'''
Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.
Котулич К.А. 122А
'''
import numpy as np # вводимо бібліотеку для масивів
g = 9.8 # вводимо змінну зі значенням прискорення вільного падіння
x = np.array([(g*(t**2))/2 for t in range(1,11)]) # за допомогою генератора списків, де одразу за формулою
# знаходиться відстань при певному часі, який визначається за допомогою циклу, створюємо масив
print(f'Відстані, пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с: {x}') # виводимо масив