'''
Дані про температуру води на Чорноморському узбережжі за декаду
вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
купання.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(10,40) for i in range(10)]) # за допомогою генератора списків створюємо масив
print(f'Дані про температуру води на Чорноморському узбережжі за декаду вересня: {x}\nКількість днів придатних для купання: {len(list(filter(lambda n: 25<n<35,x)))}')
#  щоб не створювати зайвий список одразу виводимо довжину відфільтрованого списку з умовою, що кожен елемент лежить в
# діапазоні придатної температури