'''
Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.
Котулич К.А. 122А
'''
import numpy as np # вводимо бібліотеку для масивів
print('Введіть елементи масиву:')
x = np.array([int(input()) for i in range(10)]) # за допомогою генератора списків створюємо масив за умовами
a = list() # створюємо пустий список
for i in range(len(x)): # перебираємо кожен елемент масиву
    if x[i]<0: # умова для визначення елементів що менше нуля
        a.append(x[i]) # додаємо потрібні елементи в пустий список
a1 = np.array(a) # переводимо список в масив
print(f'Добуток всіх елементів масиву цілих чисел, менших 0: {a1.prod()}') # щоб при виведенні використати вдудований метод prod