'''
Дані про температуру повітря за декаду листопада зберігаються в масиві.
Визначити, скільки разів температура опускалася нижче -10 градусів.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(-20,30) for i in range(30)]) # за допомогою генератора списків створюємо масив
a = list(filter(lambda n: n<-10,x)) # створюємо список де за допомогою фільтру залишаємо значення менше -10
print(f'Дані про температуру повітря за листопад (по днях): {x}\nТемпература опускалась нижче -10 градусів {len(a)} разів')
# виводимо довжину того списку що і показує скільки разів виконувалась умова