'''
Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність
масиву - 15. Заповнення масиву здійснити випадковими числами від 10 до 50.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(10,50) for i in range(15)]) # за допомогою генератора списків створюємо масив за умовами
y = np.array(list(filter(lambda n: n%7==0 , x))) # створюємо ще один масив, в якому відсортовані за
# потрібною умовою елементи першого масиву
print(f'Масив: {x}\nДобуток всіх його елементів, що кратні 7: {y.prod()}') # виводимо на екран суму останнього масиву
# за допомогою вбудованої ф-ї prod