'''
Дані про температуру повітря за декаду грудня зберігаються в масиві.
Визначити, скільки раз температура була вище середньої за цю декаду.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(-20,15) for i in range(10)]) # за допомогою генератора списків створюємо масив
print(f'Дані про температуру повітря за декаду грудня: {x}\nТемпература була вище середньої {len(list(filter(lambda n: n>x.mean(),x)))} разів')
# щоб не створювати зайвий список одразу виводимо довжину відфільтрованого списку з умовою, що кожен елемент
# більше середнього значення, яке ми визначили за допомогою вбудованої функції по роботі з масивами mean