'''
Знайти суму елементів масиву дійсних чисел, що мають непарні номери.
Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 100
до 200.
Котулич К.А. 122А
'''
from random import triangular # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([triangular(100,200) for i in range(20)]) # за допомогою генератора списків створюємо масив за умовами
# triangular - випадкові числа з плаваючею комою
count = list() # створюємо пустий список
for i in range(len(x)): # перебираємо елементи нашого масиву
    if i%2==1: # визначаємо елементи, індекси яких непарні
        count.append(x[i]) # додаємо їх у пустий список
c = np.array(count)  # переводимо список в масив, щоб при виведенні використати вдудований метод sum
print('Масив: {}\nСума елементів масиву, що мають непарні номери: {:.3f}'.format(x,c.sum()))
# виводимо суму на екран з трьома знаками після коми