'''
Знайти суму всіх елементів масиву цілих чисел, які менше середнього
арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 150 до 300.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(150,300) for i in range(20)]) # за допомогою генератора списків створюємо масив за умовами
a = x.sum()/20 # вводимо нову змінну зі значенням середнього арифметичного масиву
y = np.array(list(filter(lambda n: n<a, x))) # створюємо ще один масив, в якому відсортовані за
# потрібною умовою елементи першого масиву
print(f'Масив: {x}\nСума всіх його елементів, що менші за середнє арифметичне({a}): {y.sum()}')
# виводимо на екран суму елементів останнього масиву за допомогою вбудованої ф-ї sum