'''
Знайти кількість парних елементів одновимірного масиву.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(-100,100) for i in range(30)]) # за допомогою генератора списків створюємо масив за умовами
count = 0 # вводимо лічильник
for i in range(len(x)): # проходимо по елементам масиву
    if x[i]%2==0: # якщо остача від ділення на 2 дорівнює 0
        count+=1 # додаємо до лічильника 1
print(f'Масив: {x}\nВ ньому {count} парних елементів') # виводимо масив і кількість парних елементів