'''
Напишіть програму аналізу значень температури хворого за добу:
визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
температури виробляються шість раз на добу і результати вводяться з клавіатури у
масив T.
Котулич К.А. 122А
'''
import numpy as np # вводимо бібліотеку для масивів
T = np.array([float(input('Введіть значення температури: ')) for i in range(6)]) # за допомогою генератора списків створюємо масив за умовами
x = T.sum()/6 # вводимо змінну для обрахування середнього арифмктичного
print('Мінімальне значення: {:.1f}\nМаксимальне значення: {:.1f}\nСереднє арифметичне: {:.1f}'.format(T.min(),T.max(),x))
# виводимо одразу мінімальне і максимальне значення за допомогою
# вбудованих функцій, і регулюємо кількість знаків після коми