'''
Дані про температуру повітря і кількості опадів за декаду квітня
зберігаються в масивах. Визначити кількість опадів, що випали у вигляді дощу і у
вигляді снігу за цю декаду.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x,y = np.array([randint(-10,20) for i in range(10)]),np.array([randint(0,50) for j in range(10)]) # вводимо два масива
# перший для температури, другий для кількості опадів
snow = 0 # вводимо змінні для обрахунку снігу
rain = 0 # і дощу
for i in range(len(x)): # перебираємо елементи першого списку
    if x[i]<=0: # якщо температура менше нуля
        snow+=y[i] # додаємо елемент з другого списку під тим самим індексом до к-сті снігу
    else: # в іншому випадку
        rain+=y[i] # до к-сті дощу
print(f'Кількість опадів у вигляді дощу: {rain}\nКількість опадів у вигляді снігу: {snow}') # виводимо змінні