'''
Обчислити середнє арифметичне значення тих елементів одновимірного
масиву, які потрапляють в інтервал від -2 до 10.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(-50,50) for i in range(30)]) # за допомогою генератора списків створюємо масив за умовами
y = list() # створюємо пустий список
count = 0 # вводимо лічильник
while True: # вводимо цикл щоб не робити зайві перевірки
    for i in range(len(x)): # проходимо по елементам масиву
        if -2<=x[i]<=10: # якщо елемент не дорівнює заданому числу
            y.append(x[i]) # додаємо в список елемент
            count+=1 # додаємо до лічильника 1

    z = np.array(y) # переводимо список в масив щоб потім скористатись вбудованим методом sum
    if count==0: # вводимо перевірку на випадок якщо таких елементів немає в масиві
        print(f'Масив: {x}\nВ масиві немає елементів, які потрапляють в інтервал від -2 до 10')
        break
    else: # у інших випадках
        y = z.sum()/count # знаходимо середнє арифметичне

        print('Масив: {}\nСереднє арифметичне значення тих елементів, які потрапляють в інтервал від -2 до 10: {:.2f}'.format(x,y))
        # виводимо масив і середнє арифметичне
        break