'''
Дано два лінійних масиву однакової розмірності. Скласти третій масив з
добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x,y = np.array([randint(-40,40) for i in range(20)]),np.array([randint(-40,40) for j in range(20)])
# за допомогою генератора списків створюємо масиви за умовами
z = x*y # присвоюємо новій змвнній значення поелементного добутку перших двох масивів
print(f'Масив А: {x}\nМасив В: {y}\nМасив з добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом: {z}')
# виводимо всі масиви