'''
Дан лінійний масив цілих чисел. Перевірте, чи є він упорядкованим по
спаданню.
Котулич К.А. 122А
'''
# дана програма визначає строге впорядкування, а для того щоб було нестроге потрібно додати одне '='
import numpy as np # вводимо бібліотеку для масивів
x = np.array([10,9,8,7,6,5,4,3,2,1,0]) # вводимо масив
count = 0 # вводимо лічильник
for i in range(len(x)-1): # перебираємо елементи списку, крім останнього щоб не виникало помилки
    if x[i]>x[i+1]: # якщо даний елемент більший за наступний
        count+=1 # додаєм 1 до лічильника
if count==(len(x)-1): #якщо значення лічильника = довжині масиву без одного елементу, який ми не перевіряли в попередньому циклі
    print('Масив упорядкований по спаданню') # то масив впорядкований за спаданням
else: # в інших випадках - ні
    print('Масив не упорядкований по спаданню')