'''
Розсортуйте заданий лінійний масив по зростанню.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(-40,40) for i in range(20)]) # вводимо рандомний масив
print(f'Наш масив: {x}') # виводимо початковий масив
n = len(x) # заводимо змінну з довжиною масиву
for i in range(1,n): # перебираємо кожен елемент масиву крім першого
    j = i-1 # вводимо змінну для перевірки попереднього значення, по суті лічильник
    key = x[i] # вводимо ключ, який допоможе нам в порівняннях
    while j>=0 and x[j]>key: # якщо відповідає умовам
        x[j+1]=x[j] # то значення даного елементу підставляється в наступний, при цьому сам залишається з таким значенням
        j-=1 # зменшуємо індекс, щоб далі перевіряти чи потрібно підставляти це значення праворуч по масиву
    x[j+1]=key # тепер на  місце даного індексу вставляємо значення ключа
print(f'Відсортований по зростанню масив: {x}') # виводимо поточний масив