'''
Знайти суму додатніх елементів лінійного масиву цілих чисел.
Розмірність масиву - 10. Заповнення масиву здійснити з клавіатури.
Котулич К.А. 122А
'''
import numpy as np # вводимо бібліотеку для масивів
x = np.array([int(input('Введіть елемент масиву:')) for i in range(10)]) #
count = 0 # вводимо нульову змінну для подальшого обрахування
for i in range(len(x)): # перебираємо елементи масиву
    if x[i]>0: # якщо елемент додатній
        count+=x[i] # додаємо його до нашої змінної
print(f'Сума додатніх елементів масиву: {count}') # виводимо результат