'''
Змінній t привласнити значення істина, якщо в одновимірному масиві є
хоча б одне від’ємне і парне число.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(-10,20) for i in range(10)]) # за допомогою генератора списків створюємо масив за умовами
t = False # вводимо змінну зі значенням хиби
for i in range(len(x)): # перебираємо кожен елемент масиву
    if x[i]<0 and x[i]%2==0: # якщо елемент відповідає умовам
        t = True # змінній присвоюється значення істини
print(x)
print(t) # виводиться відповідне значення