'''
Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
назву першого товару з таблиці.
Котулич К.А. 122А
'''
x = ['ручка','олівець','маркер','ножиці','альбом','ручка','гумка','пензлик','скоби','точилка','пенал'] # створюємо список товарів
for i in range(1,len(x)-1): # пербираємо елементи списку крім першого
    if x[i]==x[0]: # порівнюємо їх з першим
        x.remove(x[0]) # якщо знаходимо такий самий видаляємо перший елемент
    print(x[i]) # виводить в якості таблиці
print(f'Список товарів:\n{x}') # виводимо як список