'''
Створіть масив з п'яти прізвищ і виведіть на екран ті з них, які
починаються з певної букви, яка вводиться з клавіатури.
Котулич К.А. 122А
'''
import numpy as np # вводимо бібліотеку для масивів
x = np.array(['Black','Wood','White','Amble','Houk']) # створюємо масив
while True: # основний цикл програми
    n = input('Введіть першу літеру (англійською): ') # користувач вводить літеру
    y = list() # створюємо пустий список для додаткової перевірки
    for i in range(len(x)): # перебираємо наш масив
        k = list(x[i]) # робимо з кожного елемента список
        y.append(k[0]) # заповнюємо список
        if k[0]==n : # перевіряємо чи перша літера дорівнює заданій користувачем
            print(f'підходяще прізвище: {x[i]}') # якщо так, то виводимо потрібний елемент
    if n not in y: # якщо заданої користувачем літери немає в списку
        print(f'На жаль, у списку немає прізвища, яке починається з літери {n}')
        # повідомляємо користувачеві про відсутність такого елементу

    print('Хочете спробувати ще раз? Напишіть так чи ні')  # питаємо у користувача чи хоче він повторити
    l = input()  # користувач вводить відповідь
    if l == 'так':  # якщо відповідь позитивна
        continue  # повторно проходимо цикл
    else:  # у будь-яких інших випадках
        break  # обриваємо основний цикл