'''
Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки
за ці послуги. Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень.
Котулич К.А. 122А
'''
x = ['a','b','c','d','e','f','g','h','i','j'] # створюємо список з "послугами"
y = [89,5654,32,45,66,5667,757,463,432,54,876] # і список цін, розміщені вони так щоб за індексом співпадали з послугами
while True: # цикл для перевірки та перехоплення помилок
    try:
        g = int(input('Введіть ціну: ')) # користувач вводить число
        if g in x: # додатково перевіряємо чи є дане число в  списку цін
            break
        else:
            print('Даної ціни немає в списку. Спробуйте ще раз')
    except ValueError or TypeError or KeyError:
        print('Щось пішло не так. Спробуйте ще раз') #
count = 0 # значення індексу змінної, що ввів користувач
for i in range(len(y)): # перебираємо ціни
    if y[i]==g: # яка з них співпадає з введеною користувачем
        count = i # зберігаємо індекс
for j in range(len(x)-1): # перебираємо перший список
    if j < count: # всі елеенти з меншим індексом
        x.remove(x[j]) # видаляються
for k in range(len(y)-1): # все так само як і для першого списку
        if k<count:
            y.remove(y[k])
print(f'{x}\n{y}') # виводимо два списки
