'''
Обчислити суму парних елементів одновимірного масиву до першого
зустрінутого нульового елемента.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(-10,10) for i in range(10)]) # вводимо рандомний масив
value = 0 # вводимо нульову змінну для подальшого обрахунку
while True: # вводимо цикл, щоб не робити зайвих перевірок
    for i in range(len(x)): # перебираем елементи масиву
        if x[i]!=0: # якщо елемент не нульовий
            if x[i]%2==0: # і парний
                value+=x[i] # додаємо його до змінної
        else: # коли натикаємось на нульовий елемент
            break # обриваемо перевірку
    print(f'Масив: {x}\nСума парних елементів до першого зустрічного нульового елементу: {value}') # виводимо значення змінної
    break # обриваєм цикл