'''
Підрахувати кількість елементів одновимірного масиву, для яких
виконується нерівність i*i<ai<i!
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
import math # імпортуємо бібліотеку math, для визначення факторіалу
a = np.array([randint(-100,100) for i in range(30)]) # вводимо рандомний масив
count = 0 # вводимо лічильник
for i in range(len(a)): # перебираємо всі елементи масиву
    if i**2<a[i]<math.factorial(i): # якщо елемент відповідає умові
        count+=1 # додаємо до лічильника 1
print(f'Масив: {a}\nКількість елементів для яких виконується рівність i*i<ai<i!: {count}') # виводимо значення
