'''
Перетин даху має форму півкола з радіусом R м. Сформувати таблицю,
яка містить довжини опор, які встановлюються через кожні R / 5 м.
Котулич К.А. 122А
'''
from math import sqrt # импортуємо корінь квадратний
R = int(input('Введіть радіус: ')) # користувач вводить змінну
d = R/5 # обраховуємо відстань між опорами
a = 2*(R//5) # визначаємо кількість опор
hs = [] # створюємо пустий список
x = 0 # змінна, що допоможе визначити висоту
index = a//2 # зберігаємо індекс середньої опори
for i in range(a//2): # пербираємо половину опор
    x+=d # додаємо відстань між опорсми до нашої
    h = sqrt(x*(2*R - d)) # обраховуємо висоту
    hs.append(h) # додаємо кожен елемент в список
    print('Опора {} має висоту {:.2f} м'.format(i+1,h)) # виводимо список довжин
for j in range(len(hs)): # перебираємо елементи списку
    index+=1 # допомагає зберегти нумерацію опор
    print('Опора {} має висоту {:.2f} м'.format(index,hs[-1-j])) # виводимо довжини в оберненому порядку
