'''
Змінній t привласнити значення істина, якщо максимальний елемент
одновимірного масиву єдиний і не перевищує наперед заданого числа а.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(-10,20) for i in range(10)]) # за допомогою генератора списків створюємо масив за умовами
while True: # цикл для перевірки та перехоплення помилок
    try:
        a = int(input('Введіть число: ')) # користувач вводить число
        if -10<=a<=10: # перевіряємо чи взагалі може це число трапитись в масиві
            if a in x: # додатково перевіряємо чи є дане число в масиві
                break
            else:
                print('Дане число не випало в масиві. Спробуйте ще раз')
        else:
            print('Дане число не може випасти в масиві. Спробуйте ще раз')
    except ValueError or TypeError or KeyError:
        print('Щось пішло не так. Спробуйте ще раз')
count = 0 # вводимо лічильник, щоб визначити чи єдиний елемент в масиві
t = False # вводимо змінну зі значенням хиби
for i in range(len(x)): # перебираємо кожен елемент масиву
    if x[i]==x.max():# якщо елемент відповідає умовам
        count+=1 # додаємо до лічильника 1
if x.max()<a and count==1: # якщо максимальне число менше даного
    t = True # змінній присвоюється значення істини
    print(t)
else: # в інших випадках змінна залишається зі значенням хиби
    print(t)