'''
У лінійному масиві знайти максимальний елемент. Вставте порядковий
номер елемента за ним, пересунувши всі залишилися на одну позицію вправо.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(-10,20) for i in range(10)]) # за допомогою генератора списків створюємо масив
print(f'Масив: {x}') # висодимо його
y = x[-1] # вводимо змінну зі значенням останнього елементу масиву
for i in range(len(x)): # перебираємо кожен елемент масиву
    if x[i]==x.max(): # якщо цей елемент є максимальним
        for j in range(len(x)-2,i,-1): # перебираємо елементи зправа наліво до максимального не включаючи його
            x[j+1]=x[j] # присвоюємо значення даної змінної наступному елементу
        x[i+1]=i # присвоюємо наступному елементу після максимального значення його індексу
print(f'Змінений масив: {np.append(x,y)}') # виводимо отриманій масив з додаванням в кінці змінну зі значенням
# останнього елементу початкового масиву
