'''
В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементи
масиву так, щоб спочатку розташовувалися всі нулі, потім все одиниці, а потім всі
п'ятірки. Додаткового масиву не заводити.
Котулич К.А. 122А
'''
import numpy as np # вводимо numpy
from random import choice # вводимо рандом
n = int(input('Введіть довжину масиву: ')) # користувач вводить число
x = np.array([choice([0,1,5]) for i in range(n)]) # заповнюємо масив довжини n, на кожне місце ставиться одне з трьох чисел
print(x) # виводимо наш масив
# використовуємо алгоритм сортування вибором
a = len(x) # заводимо змінну з довжиною масиву
for i in range(a-1): # перебираємо кожен елемент масиву крім останнього
    min = i # присвоюємо дане значення як мінімальне
    for j in range(i+1,a): # перебираємо кожен елемент масиву від наступної позиціїї до останньої в масиві
        if x[j]<x[min]: # якщо даний елемент менше раніше присвоєного мінімального
            min = j # переприсвоюємо мінімальному значенню дану змінну
    x[i],x[min] = x[min],x[i] # міняємо місцями елементи
print(x) # виводимо отриманий масив