'''
Знайти найбільший елемент з елементів одновимірного масиву, що мають
парний номер. Визначити, чи є він єдиним.
Котулич К.А. 122А
'''
import numpy as np # вводимо numpy
from random import randint # вводимо рандом
x = np.array([randint(1,5) for i in range(10)]) # створюємо масив за допомогою генератора списків
max = 0 # вводимо змінну для збереження максимального значення
count = 0 # вводимо лічильник
for i in range(len(x)): # перебираємо елементи списку
    if x[i]==x.max(): # знаходимо максимальний
        if i%2==0: # якщо його індекс парний
            max = x[i] # зберігаємо це значення
            count+=1 # рахуємо скільки таких елементів
        else: # у іному випадку
            x[i]=0 # присвоюємо цій змінній значення нуля і продовжуємо пошуки
if count==1: # перевірка на кількість таких елементів в масиві
    print(f'Максимальний елемент з парним номером: {max}. Він єдиний в масиві')
else:
    print(f'Максимальний елемент з парним номером: {max}. Він не єдиний в масиві')