'''
У будинку, що складається з 30 квартир, переселити мешканців так, щоб
мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
Котулич К.А. 122А
'''
import numpy as np # вводимо numpy
from random import randint # вводимо рандом
x = np.array([randint(1,10) for i in range(30)]) # створюємо масив за допомогою генератора списків
print(f'Кількість мешканців по квартирам: {x}') # виводимо початковий масив
index = -1 # додаємо лічильник, який допоможе визначати елемент з іншого кінця списку
count = 0 # вводимо лічильник
for i in range(len(x)//2): # перебираємо половину списку
    x[i],x[index]=x[index],x[i] # і міняємо елементи місцями з відповідними
    index-=1 # значення індексу зменшується на 1
for j in range(len(x)): # перебираємо кожен елемент списку
    if x[j]>5: # в пошуках квартир, де живе більше 5 осіб
        count+=1 # рахуємо їх
print(f'Після переїзду: {x}\nКількість квартир, де живе більше 5 осіб: {count}') # виводимо значення