'''
Введіть масив з 20 елементів і визначте, чи є в ньому елементи з
однаковими значеннями.
Котулич К.А. 122А
'''
import numpy as np # вводимо numpy
from random import randint # вводимо рандом
x = np.array([randint(-40,40) for i in range(20)]) # створюємо масив з рандомних значень
print(x)
flag = False # вводимо прапорець зі значенням хиби
for i in range(len(x)): #  перебираємо елементи списку
    for j in range(len(x)): # і знову
        if j!=i: # якщо це не сам елемент
            if x[i]==x[j]: # якщо даний елемент дорівнює якомусь з елементів
                flag = True # змінюємо значення на істину
if flag==True: # якщо істина
    print('В масиві є елементи з однаковим значенням')
else: # якщо хиба
    print('В масиві немає елементів з однаковим значенням')