'''
Дан одновимірний масив а. Сформувати новий масив, який складається
тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
елементів немає, то видати повідомлення.
Котулич К.А. 122А
'''
import numpy as np # вводимо numpy
from random import randint # вводимо рандом
a = np.array([randint(0,50) for i in range(30)]) # створюємо масив за допомогою генератора списків
print(a)
x = [] # створюємо пустий список
for i in range(len(a)): # перебираємо елементи масиву
    if a[i]-i==10: # перевіряємо елемент на задану умову, якщо відповідає їй
        x.append(a[i]) #  одаємо елемент у список
x = np.array(x) # перетворюємо список у масив
if len(x)!=0: # якщо в масиві є елементи
    print(f'Масив з елементами, які перевищують свій номер на 10: {x}') # виводимо його
else: # якщо ні
    print('В цьому масиві немає елементів, які перевищують свій номер на 10') # видаємо повідомлення