'''
Якщо в одновимірному масиві є три поспіль однакових елемента, то
змінній r привласнити значення істина.
Котулич К.А. 122А
'''
import numpy as np # вводимо numpy
from random import randint # вводимо рандом
x = np.array([randint(1,5) for i in range(10)]) # створюємо масив за допомогою генератора списків
r = False # вводимо нашу змінну зі значенням хиби
for i in range(len(x)-2): # перебираємо елементи списку
    if x[i]==x[i+1] and x[i]==x[i+2]: # якщо даний елемент дорівнює трьом наступним
        r = True # присвоюємо змінній значення істини
print(r) # виводимо змвнну
print(x)