'''
Дан одновимірний масив з 10 цілих чисел. Підрахуйте найбільше число
однакових чисел, що йдуть підряд в ньому.
Котулич К.А. 122А
'''
import numpy as np # вводимо numpy
from random import randint # вводимо рандом
x = np.array([randint(1,5) for i in range(10)]) # створюємо масив за допомогою генератора списків
print(x) # виводимо масив
count = 1 # вводимо лічильник для основного значення
for i in range(len(x)-1): # перебираємо елементи масиву крім останнього
    count1 = 1 # вводимо лічильник на випадок якщо не одразу натрапимо на найбільш частий елемент
    f = 1 # вводимо змінну для порівнянь
    for j in range(i+1,len(x)): # перебираємо кожен елемент з наступного
        if x[i]==x[j] and j-i==f: # порівнюємо з даним, так щоб різниця їх індексів була f
            count1+=1 # рахуємо їх
            f+=1 # збільшуємо кожен раз різницю між позиціями елементів збільшувалась
    if count1>count: # якщо знайшовся елемент якого більше ніж 1
        count = count1 # робимо його кількість основним значенням
if count>1: # якщо є елемент якого більше ніж 1
    print(f'Найбільше число однакових чисел, що йдуть підряд в масиві: {count}') # виводимо кількість
else:  # якщо ні
    print('Кожен елемент в цьому масиві унікальний')