'''
Створіть масив А [1..12] за допомогою генератора випадкових чисел з
елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
масиву числом 0.
Котулич К.А. 122А
'''
from random import randint # вводимо рандом
import numpy as np # вводимо бібліотеку для масивів
x = np.array([randint(-20,10) for i in range(12)]) # за допомогою генератора списків створюємо масив
print(f'Масив: {x}') # виводимо масив
for i in range(len(x)): # перебираємо кожен елемент масиву
    if x[i]<0: # умова для визначення елементів що менше нуля
        x[i]=0 # заміняємо елементи що менше нуля на 0
print(f'Масив після заміни: {x}') # виводимо отриманий масив